# Práctica Clase 6

1) Cargar el dataset "Emisiones_CO2.csv" provisto en la clase 2 en un Dataframe de Pandas, quitar los registros que contengan valores faltantes e implementar una nueva columna, que contenga el resultado de una función Hash aplicada sobre el campo "Código de País" y se denomine "Clave_Hash".<br>
Consideraciones: Se puede utilizar la función provista.

In [1]:
def hash_function(key):
    return sum(index * ord(character) for index, character in enumerate(repr(key), start=1))

La funcion anterior se llama list comprehesion, la cual se le da una estructura de una linea a un codigo de lista, el resultado es una lista

In [3]:
#Es similar a lo siguiente:

lista = ['banana', 'manzana', 'pera', 'sandia', 'kiwi', 'coco']
listanueva= []
for x in lista:
    if 'a' in x:
        listanueva.append(x)
print(listanueva)

['banana', 'manzana', 'pera', 'sandia']

In [5]:
#Con list comprehesion:

listanueva = [x for x in lista if 'a' in x]
print(listanueva)

['banana', 'manzana', 'pera', 'sandia']

In [2]:
print(hash_function('pato'))
print(hash_function('tapo'))

1807
1799

Cargar la libreria PANDA

In [3]:
import pandas as pd

Cargar el dataset

In [4]:
df = pd.read_csv('Emisiones_CO2.csv',sep='|',decimal=',', encoding='latin-1', thousands= '.')

Vamos a revisar el dataset

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11127 entries, 0 to 11126
Data columns (total 6 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   Código de país                       11127 non-null  object
 1   Nombre del país                      11127 non-null  object
 2   Región                               11127 non-null  object
 3   Año                                  11127 non-null  int64
 4   CO2 (kt)                             9032 non-null   float64
 5   CO2 per cápita (toneladas métricas)  9029 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 521.7+ KB

In [10]:
df.head()

,Código de país,Nombre del país,Región,Año,CO2 (kt),CO2 per cápita (toneladas métricas)
0,ABW,Aruba,América Latina y Caribe,1960,NaN,NaN
1,ABW,Aruba,América Latina y Caribe,1961,NaN,NaN
2,ABW,Aruba,América Latina y Caribe,1962,NaN,NaN
3,ABW,Aruba,América Latina y Caribe,1963,NaN,NaN
4,ABW,Aruba,América Latina y Caribe,1964,NaN,NaN

In [14]:
df.tail()

,Código de país,Nombre del país,Región,Año,CO2 (kt),CO2 per cápita (toneladas métricas)
11122,ZWE,Zimbabue,África subsahariana,2007,9732.22,0.731867
11123,ZWE,Zimbabue,África subsahariana,2008,7682.37,0.569255
11124,ZWE,Zimbabue,África subsahariana,2009,8239.75,0.600521
11125,ZWE,Zimbabue,África subsahariana,2010,9028.15,0.646073
11126,ZWE,Zimbabue,África subsahariana,2011,9860.56,0.691698

Vemos que CO2 esta como "Objet" que es STR, pero sabemos que es un float, podemos transformarlo con una funcion LAMBDA o podemos cambiar lo que necesitamos antes de importar el dataset agregando thousand = '.' para indicarle que el . son los miles y decimal = ',' para indicarle que la , es decimal en el dataset, luego hara la transformacion correspondiente.

Otra cosa que debemos hacer es ver si existen nulos en el dataset, con la siguiente funcion:

In [5]:
df.isnull().any() #aca vemos si hay algun nulos en alguna columna

Código de país                         False
Nombre del país                        False
Región                                 False
Año                                    False
CO2 (kt)                                True
CO2 per cápita (toneladas métricas)     True
dtype: bool

Una forma que podriamos hacer para eliminarlos es dropna

In [6]:
df = df.dropna(axis = 0) #El axis=0 es para que solo elimine la fila y no toda la columna

In [26]:
print(df.tail())
print(df.head())

      Código de país Nombre del país               Región   Año  CO2 (kt)  \
11122            ZWE        Zimbabue  África subsahariana  2007   9732.22
11123            ZWE        Zimbabue  África subsahariana  2008   7682.37
11124            ZWE        Zimbabue  África subsahariana  2009   8239.75
11125            ZWE        Zimbabue  África subsahariana  2010   9028.15
11126            ZWE        Zimbabue  África subsahariana  2011   9860.56

       CO2 per cápita (toneladas métricas)
11122                             0.731867
11123                             0.569255
11124                             0.600521
11125                             0.646073
11126                             0.691698
   Código de país Nombre del país                   Región   Año  CO2 (kt)  \
26            ABW           Aruba  América Latina y Caribe  1986   179.683
27            ABW           Aruba  América Latina y Caribe  1987   447.374
28            ABW           Aruba  América Latina y Caribe  1988   612.389
29            ABW           Aruba  América Latina y Caribe  1989   649.059
30            ABW           Aruba  América Latina y Caribe  1990  1840.830

    CO2 per cápita (toneladas métricas)
26                             2.868319
27                             7.234964
28                            10.026508
29                            10.634733
30                            29.620165

Renombrar columnas con un diccionario:

In [7]:
df = df.rename(columns= { 'Código de país' : 'cod_pais',
               'Nombre del país' : 'nom_pais',
                'Región': 'region',
                'Año': 'año',
                'CO2 (kt)': 'co2',
                'CO2 per cápita (toneladas métricas)' : 'co2_per_capita'})

In [33]:
df.head()

   cod_pais nom_pais                   region   año       co2  co2_per_capita
26      ABW    Aruba  América Latina y Caribe  1986   179.683        2.868319
27      ABW    Aruba  América Latina y Caribe  1987   447.374        7.234964
28      ABW    Aruba  América Latina y Caribe  1988   612.389       10.026508
29      ABW    Aruba  América Latina y Caribe  1989   649.059       10.634733
30      ABW    Aruba  América Latina y Caribe  1990  1840.830       29.620165

Metodo para ver valores unicos o cuantas veces se repiten

In [8]:
df['cod_pais'].value_counts()

HND    52
TTO    52
KNA    52
KOR    52
TON    52
       ..
TLS    10
LSO     7
MNE     7
SRB     6
LIE     5
Name: cod_pais, Length: 199, dtype: int64

Eliminar los duplicados

In [40]:
df.drop_duplicates('cod_pais', inplace= True)

df['cod_pais'].value_counts()

ABW    1
MRT    1
MWI    1
MYS    1
NAM    1
      ..
GNB    1
GNQ    1
GRC    1
GRD    1
ZWE    1
Name: cod_pais, Length: 199, dtype: int64

In [41]:
print(df.head())

    cod_pais    nom_pais                   region   año       co2  \
26       ABW       Aruba  América Latina y Caribe  1986   179.683
87       AND     Andorra    Europa y Asia Central  1995   407.037
104      AFG  Afganistán              Sur de Asia  1960   414.371
156      AGO      Angola      África subsahariana  1960   550.050
208      ALB     Albania    Europa y Asia Central  1960  2024.180

     co2_per_capita
26         2.868319
87         6.374495
104        0.046068
156        0.104357
208        1.258195

Traer todos los datos posteriores a un año, usando mascaras booleanas

In [43]:
maskaño = df['año']>2000
maskaño

26       False
87       False
104      False
156      False
208      False
         ...
10867    False
10919    False
10971    False
11027    False
11079    False
Name: año, Length: 199, dtype: bool

In [44]:
df[maskaño]

,cod_pais,nom_pais,region,año,co2,co2_per_capita
5819,LIE,Liechtenstein,Europa y Asia Central,2007,69.673,1.966442
5921,LSO,Lesoto,África subsahariana,2005,1419.130,0.736887
6805,MNE,Montenegro,Europa y Asia Central,2005,2057.190,3.349044
9041,SRB,Serbia,Europa y Asia Central,2006,53765.550,7.254274
9921,TLS,Timor Oriental,Asia Oriental y Asia-Pacífico,2002,161.348,0.180310

Todo dato de la decada del 90 (desde 1990 hasta 1999)

In [49]:
maskañonoventa = (df['año'] >= 1990) & (df['año'] <= 1999)
maskañonoventa

26       False
27       False
28       False
29       False
30        True
         ...
11122    False
11123    False
11124    False
11125    False
11126    False
Name: año, Length: 9029, dtype: bool

In [14]:
df['clave_hash'] = df['cod_pais'].apply(lambda x: hash_function(x))
df.tail()

,cod_pais,nom_pais,region,año,co2,co2_per_capita,clave_hash
11122,ZWE,Zimbabue,África subsahariana,2007,9732.22,0.731867,951
11123,ZWE,Zimbabue,África subsahariana,2008,7682.37,0.569255,951
11124,ZWE,Zimbabue,África subsahariana,2009,8239.75,0.600521,951
11125,ZWE,Zimbabue,África subsahariana,2010,9028.15,0.646073,951
11126,ZWE,Zimbabue,África subsahariana,2011,9860.56,0.691698,951

In [39]:
df['clave_hash'].value_counts()

Series([], Name: clave_hash, dtype: int64)

Hash funcion 2:

In [16]:
def hash_function2(key1, key2):
   A = (index * ord(character) for index, character in enumerate(repr(key1), start=1))
   B = (index * ord(character) for index, character in enumerate(repr(key2), start=1))
   C = A*B
   return C

In [50]:
df['clave_hash'] = df['cod_pais'].apply(lambda x: hash_function(x)) * df['cod_pais'].apply(lambda x: hash_function(x)) + df['año']

In [51]:
df['clave_hash'].value_counts()

876223    5
830111    5
876226    5
830106    5
830107    5
         ..
917837    1
917838    1
917839    1
917840    1
933236    1
Name: clave_hash, Length: 5183, dtype: int64

In [54]:
df['clave_hash'].drop_duplicates(inplace= True)

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9029 entries, 26 to 11126
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   cod_pais        9029 non-null   object
 1   nom_pais        9029 non-null   object
 2   region          9029 non-null   object
 3   año             9029 non-null   int64
 4   co2             9029 non-null   float64
 5   co2_per_capita  9029 non-null   float64
 6   clave_hash      9029 non-null   int64
dtypes: float64(2), int64(2), object(3)
memory usage: 564.3+ KB

2. A partir del Dataframe creado en el punto 1, construir uno nuevo, que contenga solo los valores distintos de la tupla "Clave_Hash", "Código de País" , "Nombre de país" y "Región". Quitando luego del dataframe original los campos "Código de País" , "Nombre de país" y "Región"